import React from 'react';
import MainContainer from "../components/MainContainer/MainContainer";
import CentralBody from "../components/centralBody/centralBody";
import ArticleFullView from "../components/ArticleFullView/ArticleFullView";

const Regulation = () => {
    return (
        <div>
            <MainContainer
                description={"Устав Революционной Рабочей Партии"}
                title={"Устав Революционной Рабочей Партии"} keywords={"коммунизм, рабочее движение, троцкизм, права рабочих"}
            >
                <CentralBody>
                    <ArticleFullView>{[{title: 'Устав РРП', full_description: 'Политической целью организации является установление рабочей власти в стране и коммунистическая революция во всем мире.\n' +
                            '\n' +
                            'Защита интересов рабочего класса и всех эксплуатируемых является первоначальной мотивировочной частью любого решения.\n' +
                            '\n' +
                            'РРП — политическая организация, основанная и действующая на идеях и политической традиции большевиков-ленинцев.\n' +
                            '\n' +
                            'I. О ЧЛЕНАХ И КАНДИДАТАХ В ЧЛЕНЫ ПАРТИИ\n' +
                            '\n' +
                            '1.1. Членом партии считается всякий, признающий Программу и Устав партии, работающий в одной из ее организаций и подчиняющийся партийной дисциплине. Член партии имеет право решающего голоса на собрании первичной или районной организации, в которой он состоит, имеет право избираться в партийные органы, а также обязан участвовать в партийной работе, выполнять партийные поручения, посещать партийные мероприятия и регулярно уплачивать взносы в кассу первичной организации, в которой он состоит.\n' +
                            '\n' +
                            '1.2. Новые члены принимаются районными или первичными партийными организациями, их комитетами, а также вышестоящими органами.\n' +
                            '\n' +
                            '1.3. Всякий член одной организации при переезде в район работы другой организации принимается последней с согласия прежней организации или вышестоящего органа.\n' +
                            '\n' +
                            '1.4. Вопрос об исключении кого-либо из партии решается общим собранием или комитетом той организации, членом в которой данное лицо состоит, или вышестоящим комитетом. Если член партии является членом того или иного руководящего органа, то решение о его исключении принимается общим собранием организации, в которой он состоит, а также вышестоящим руководящим органом, в который он входит. Решение об исключении члена партии может быть опротестовано в контрольно-ревизионном органе. Члены Центрального Комитета (далее — ЦК) и Центральной Ревизионной Комиссии (далее — ЦРК) могут быть исключены только Съездом.\n' +
                            '\n' +
                            '1.5. Для вступления в партию желающий должен мотивированно обосновать свое желание стать членом партии и подать в местную первичную или районную организацию заявление о вступлении в простой письменной форме. Подавший заявление о вступлении в партию получает статус кандидата в члены партии. Центральный или районный комитет имеет право заблокировать заявление о вступлении.\n' +
                            '\n' +
                            '1.6. Кандидат в члены партии имеет право присутствовать на партийных собраниях и мероприятиях, имеет право совещательного голоса при принятии решений партийными организациями и обязан участвовать в партийной работе, выполняя партийные поручения, и уплачивать членские взносы на равных основаниях с членами партии.\n' +
                            '\n' +
                            '1.7. Кандидату в члены партии устанавливается срок не менее месяца, но не более шести месяцев до рассмотрения соответствующим партийным органом заявления о вступлении и принятия решения по нему. По истечении этого срока орган, в который было подано заявление, либо вышестоящий орган принимает решение, удовлетворить ли заявление или продлить срок, если кандидат еще недостаточно готов стать членом партии. В ряде случаев орган, в который было подано заявление, может отказать в его удовлетворении, тогда кандидат в члены партии переводится в разряд сторонника партии. Такое решение может быть обжаловано в вышестоящих партийных органах вплоть до съезда партии.\n' +
                            '\n' +
                            '1.8. Решение по заявлению о вступлении в партию может быть рассмотрено и без кандидатского срока сразу же на ближайшем собрании первичной или районной организации или ее комитета в случае, если заявление подает рабочий, пришедший в партию в результате рабочего конфликта на предприятии.\n' +
                            '\n' +
                            'II. ОБ ОРГАНИЗАЦИОННОМ СТРОЕНИИ ПАРТИИ\n' +
                            '\n' +
                            '2.1. Руководящим принципом организационного строения партии является демократический централизм.\n' +
                            '\n' +
                            '2.2. Партия строится на основах демократического централизма по территориальному и функциональному признакам; организация, ведущая работу на территории какого-либо района, считается высшей по отношению ко всем организациям, ведущим работу на территории части данного района.\n' +
                            '\n' +
                            '2.3. Высшим руководящим органом каждой организации является общее собрание или конференция.\n' +
                            '\n' +
                            '2.4. Общее собрание или конференция избирают комитет, который является их исполнительным органом и руководит всей текущей работой местной организации. Также избирается ревизионная комиссия, которая контролирует деятельность комитета и организации в целом.\n' +
                            '\n' +
                            '2.5. Порядок подчинения, отчетности, прохождения и оспаривания всех партийных решений (от высшей инстанции к низшей) таков: партийный съезд, центральные органы (ЦК, ЦРК), районное собрание или конференция, районный комитет и т. д.\n' +
                            '\n' +
                            '2.6. Все районные организации утверждаются ЦК, первичные организации утверждаются районным комитетом.\n' +
                            '\n' +
                            'III. О ЦЕНТРАЛЬНЫХ УЧРЕЖДЕНИЯХ ПАРТИИ\n' +
                            '\n' +
                            '3.1 Высшим руководящим органом партии является Съезд. Очередные Съезды созываются один раз в два года. Чрезвычайные Съезды созываются Центральным Комитетом по собственной инициативе или по требованию не менее 1/3 от общего числа членов, представленных на последнем партийном съезде или более 50% членов партии. Созыв партийного Съезда и порядок дня объявляются не позже, чем за один месяц до предполагаемой даты Съезда. Чрезвычайный Съезд созывается в двухмесячный срок. Съезд считается действительным, если на нем представлено не менее половины всех членов партии, представленных на последнем очередном Съезде. Нормы представительства на Съезде партии устанавливаются ЦК.\n' +
                            '\n' +
                            '3.2. В случае не созыва Центральным Комитетом чрезвычайного Съезда в указанный срок, организации, потребовавшие его, имеют право образовать Организационный Комитет, пользующийся всеми правами Центрального Комитета по созыву Съезда.\n' +
                            '\n' +
                            '3.3. Съезд в промежуток между Съездами избирает руководящий партийный орган — Центральный Комитет, кандидатов в члены ЦК, контрольный орган — Центральную Ревизионную Комиссию.\n' +
                            '\n' +
                            '3.4. Центральный Комитет представляет партию во взаимодействии с другими партиями, организациями и учреждениями, организует различные учреждения партии и руководит их деятельностью, назначает редакции центральных органов, работающих под его контролем, организует и ведет предприятия, имеющие общепартийное значение, сохраняет и применяет нормы партийной традиции, осуществляет свою связь с районными организациями, распределяет силы и средства партии и заведует центральной кассой.\n' +
                            '\n' +
                            '3.5. Центральный Комитет собирается не менее одного раза в квартал и представляет доклад о своей деятельности ближайшему партийному Съезду.\n' +
                            '\n' +
                            '3.6. Центральная Ревизионная Комиссия имеет право проводить ревизию кассы и всех предприятий ЦК, ревизию кадрового состава партийных организаций, рассматривать апелляции на восстановление в партии исключенных членов партии и выносить по ним решения, разбирать конфликтные ситуации между членами партии. Центральная Ревизионная Комиссия обязана следить за соблюдением Устава и Программы партии. Центральная Ревизионная Комиссия координирует работу районных и первичных ревизионных комиссий. Решения Центральной Ревизионной Комиссии носят обязательный характер и могут быть оспорены Съездом Партии.\n' +
                            '\n' +
                            '3.7. Центральная Ревизионная Комиссия собирается по мере необходимости и представляет доклад о своей деятельности ближайшему партийному Съезду.\n' +
                            '\n' +
                            '3.8. Кандидаты в члены Центрального Комитета являются кадровым резервом ЦК, имеют право совещательного голоса и в случае необходимости могут быть кооптированы в состав данного органа решением абсолютного большинства действующих членов ЦК вне Съезда.\n' +
                            '\n' +
                            '3.9 В промежуток между съездами в партии на постоянной основе функционирует Совет - совещательный орган при ЦК, объединяющий все региональные организации. Совет формируется из избранных региональными организациями делегатов, избираемых по норме представительства, установленной ЦК. Региональная организация имеет право отзыва делегатов из совета. В задачи Совета входит налаживание связи между региональными организациями, обмен опыта между ними, систематизация теоретической и практической деятельности партии. ЦК может при необходимости делегировать Совету часть своих полномочий.\n' +
                            '\n' +
                            'IV. О РАЙОННЫХ ОРГАНИЗАЦИЯХ\n' +
                            '\n' +
                            '4.1. Партийные организации с разрешения ЦК могут объединяться. Районный комитет избирается на районной конференции или на общем собрании. Границы района определяются районной конференцией или общим собранием и утверждаются ЦК.\n' +
                            '\n' +
                            '4.2. Очередная районная конференция или общее собрание созывается районным комитетом не менее одного раза в год, чрезвычайная — по решению районного комитета или 1/3 от общего числа членов, входящих в организацию.\n' +
                            '\n' +
                            '4.3. Норма представительства на районной конференции устанавливается районным комитетом.\n' +
                            '\n' +
                            '4.4. Районная конференция или общее собрание заслушивает отчеты районного комитета, ревизионной комиссии и избирает комитет и ревизионную комиссию.\n' +
                            '\n' +
                            '4.5. Районный комитет организует различные учреждения партии в пределах района деятельности, руководит их деятельностью.\n' +
                            '\n' +
                            '4.6. Районный комитет собирается не менее одного раза в месяц.\n' +
                            '\n' +
                            '4.7 СМИ районных организаций находятся в ведении самих районных организаций в установленном районными комитетами порядке.\n' +
                            '\n' +
                            'V. О ПЕРВИЧНЫХ ОРГАНИЗАЦИЯХ\n' +
                            '\n' +
                            '5.1. Очередная первичная конференция или общее собрание созывается первичным комитетом не менее одного раза в три месяца, чрезвычайная — по решению первичного комитета или 1/3 от общего числа членов организаций, входящих в организацию.\n' +
                            '\n' +
                            '5.2. Норма представительства на первичной конференции устанавливается первичным комитетом.\n' +
                            '\n' +
                            '5.3. Первичная конференция или общее собрание заслушивает отчеты первичного комитета, ревизионной комиссии, избирает комитет и ревизионную комиссию.\n' +
                            '\n' +
                            '5.4. Первичный комитет организует различные учреждения партии в пределах первичной деятельности, руководит их деятельностью.\n' +
                            '\n' +
                            '5.5. Первичный комитет собирается не менее одного раза в месяц.\n' +
                            '\n' +
                            'VI. О ПАРТИЙНОЙ ДИСЦИПЛИНЕ\n' +
                            '\n' +
                            '6.1. Неисполнение постановлений высших организаций влечет за собой: для организации — порицание, назначение временного комитета сверху и общую перерегистрацию (роспуск организации); для отдельных членов партии — партийное порицание, временное отстранение от ответственной партийной работы, временное отстранение от всякой партийной работы, исключение из партии.\n' +
                            '\n' +
                            '6.2. Дисциплинарные проступки рассматриваются ревизионными комиссиями и общими собраниями в обычном порядке по установленным инстанциям.\n' +
                            '\n' +
                            'VII. О ДЕНЕЖНЫХ СРЕДСТВАХ ПАРТИИ\n' +
                            '\n' +
                            '7.1. Денежные средства организации составляются из членских взносов и добровольных пожертвований.\n' +
                            '\n' +
                            '7.2 Устанавливается размер членских взносов — 1 % от дохода члена организации при минимальном взносе, размер которого определяют районные организации, при минимальном размере в 200 рублей. В отдельных случаях допускается изменение минимального размера взноса или освобождение от взносов решением комитета либо общего собрания или конференции первичной или районной организации. Районные организации обязаны уведомить о таких изменениях ЦК.\n' +
                            '\n' +
                            '7.3. Члены партии, не уплатившие в установленный срок взносы без уважительных причин, считаются выбывшими из организации, о чем доводится до сведения общего собрания и вышестоящих органов. Член партии или кандидат в члены партии, попавший в тяжелое финансовое положение, может быть освобожден от уплаты взносов решением собрания первичной или районной организации, в которой он состоит, ее комитета, ЦК или съезда партии. Член партии или кандидат в члены партии должен для этого подать в соответствующий орган заявление в простой письменной форме.\n' +
                            '\n' +
                            '7.4. Все районные организации должны отчислять ЦК членские взносы в размере 20% от общей суммы собранных взносов не реже одного раза в месяц.\n' +
                            '\n' +
                            '7.5. Центральный Комитет обязан каждый месяц по окончании сбора членских взносов публиковать среди членов партии подробный отчет о текущем состоянии партийной кассы, всех осуществленных тратах и всех финансовых поступлениях, в т. ч. добровольных пожертвованиях.\n' +
                            '\n' +
                            'Принят XI Съездом Революционной Рабочей Партии\n' +
                            '\n' +
                            'Правки внесены XV Съездом Революционной Рабочей Партии 10–11.05.2024'
                    }]}</ArticleFullView>
                </CentralBody>
            </MainContainer>
        </div>
    );
};

export default Regulation;